/**
 * Напишите программу, которая возвращает наибольшее число палиндром, которое является произведением двух простых пятизначных чисел, а также возвращает сами сомножители.
 * <p>
 * Простое число - это натуральное число, которое делится нацело только на 1 и на себя само (2, 3, 5, 7, 11, …).
 * <p>
 * Палиндром – строка, которая читается одинаково в обоих направлениях (например ABBA).
 * <p>
 *
 * @author <a href="mailto:andreyzarazka@gmail.com">Andrew Zarazka</a>
 * @since 08.10.2017
 */
package com.intetics;